Author: Stella Indranawaski

# Import Libraries

In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Load Dataset

In [8]:
df = pd.read_csv('loan_customer.csv')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 621 entries, 0 to 620
Data columns (total 17 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   loan_id             621 non-null    object
 1   birth_date          572 non-null    object
 2   phone_number        569 non-null    float64
 3   gender              608 non-null    object
 4   married             618 non-null    object
 5   dependents          605 non-null    object
 6   education           620 non-null    object
 7   self_employed       588 non-null    object
 8   applicant_income    612 non-null    float64
 9   coapplicant_income  621 non-null    float64
 10  loan_amount         621 non-null    int64
 11  loan_term_month     621 non-null    int64
 12  loan_term_year      621 non-null    int64
 13  credit_history      570 non-null    float64
 14  has_credit_card     88 non-null     object
 15  property_type       620 non-null    object
 16  loan_status         621 non-null    object
dtypes: float64(4), int64(3), object(10)
memory usage: 82.6+ KB

In [10]:
df.head()

,loan_id,birth_date,phone_number,gender,married,dependents,education,self_employed,applicant_income,coapplicant_income,loan_amount,loan_term_month,loan_term_year,credit_history,has_credit_card,property_type,loan_status
0,LP001002,1977-05-15,6.281142e+11,Male,No,0,Graduate,No,5849.0,0.0,100000,360,30,1.0,NaN,house,APPROVE
1,LP001003,1979-08-24,6.287764e+11,Male,Yes,1,Graduate,No,4583.0,1508.0,128000,360,30,1.0,NaN,studio,REJECT
2,LP001005,1991-03-28,6.281192e+11,Male,Yes,0,Graduate,Yes,3000.0,0.0,66000,360,30,1.0,NaN,house,APPROVE
3,LP001006,1980-06-02,6.285634e+10,Male,Yes,0,Not Graduate,No,2583.0,2358.0,120000,360,30,1.0,NaN,house,APPROVE
4,LP001008,1989-05-19,6.281130e+11,Male,No,0,Graduate,No,6000.0,0.0,141000,360,30,1.0,NaN,house,APPROVE

# Data Cleansing

## Handling missing values

In [11]:
# jumlah entry NULL setiap kolom
df.isna().sum()

loan_id                 0
birth_date             49
phone_number           52
gender                 13
married                 3
dependents             16
education               1
self_employed          33
applicant_income        9
coapplicant_income      0
loan_amount             0
loan_term_month         0
loan_term_year          0
credit_history         51
has_credit_card       533
property_type           1
loan_status             0
dtype: int64

In [12]:
# drop baris yang missing values
df = df.dropna()

In [13]:
#cek
df.isna().sum()

loan_id               0
birth_date            0
phone_number          0
gender                0
married               0
dependents            0
education             0
self_employed         0
applicant_income      0
coapplicant_income    0
loan_amount           0
loan_term_month       0
loan_term_year        0
credit_history        0
has_credit_card       0
property_type         0
loan_status           0
dtype: int64

## Handling duplicated data

In [14]:
# cek jumlah duplicated rows
df.duplicated().sum()

0

## Handling Outlier

In [16]:
print(f'Jumlah baris sebelum memfilter outlier: {len(df)}')

for col in ['applicant_income', 'coapplicant_income', 'loan_amount']:
    Q1 = df[col].quantile(0.25)
    Q3 = df[col].quantile(0.75)
    IQR = Q3 - Q1
    low_limit = Q1 - 1.5*IQR
    high_limit = Q3 + 1.5*IQR
    df = df[(df[col] >= low_limit) & (df[col] <= high_limit)]

print(f'Jumlah baris setelah memfilter outlier : {len(df)}')

Jumlah baris sebelum memfilter outlier: 45
Jumlah baris setelah memfilter outlier : 43

## Feature Encoding

In [17]:
# pengelompokan kolom
nums = ['phone_number', 'applicant_income', 'coapplicant_income', 'loan_amount', 'loan_term_month', 'loan_term_year', 'credit_history']
cats = ['loan_id', 'birth_date', 'gender', 'married', 'dependents', 'education', 'self_employed', 'has_credit_card', 'property_type', 'loan_status']

In [18]:
# pengecekan nilai kolom kategorikal

for col in cats:
    print(f'value counts of column {col}')
    print(df[col].value_counts())
    print('---'*10, '\n')

value counts of column loan_id
LP001068    1
LP002377    1
LP002082    1
LP002119    1
LP002126    1
LP002160    1
LP002250    1
LP002277    1
LP002337    1
LP002345    1
LP002407    1
LP001990    1
LP002494    1
LP002500    1
LP002517    1
LP002536    1
LP002683    1
LP002741    1
LP002868    1
LP002916    1
LP001994    1
LP001953    1
LP001073    1
LP001392    1
LP001095    1
LP001131    1
LP001144    1
LP001248    1
LP001255    1
LP001266    1
LP001310    1
LP001319    1
LP001507    1
LP001910    1
LP001514    1
LP001692    1
LP001698    1
LP001699    1
LP001720    1
LP001807    1
LP001849    1
LP001872    1
LP002961    1
Name: loan_id, dtype: int64
------------------------------

value counts of column birth_date
1986-09-10    1
1985-05-31    1
1989-01-24    1
1986-10-07    1
1985-08-02    1
1990-11-27    1
1984-06-23    1
1972-06-12    1
1982-06-30    1
1981-08-16    1
1981-08-22    1
1980-08-03    1
1990-08-07    1
1987-04-07    1
1983-09-30    1
1988-08-22    1
1976-11-04    1
1986-02-23    1
1984-02-14    1
1987-04-15    1
1977-10-14    1
1988-03-21    1
1989-02-05    1
1986-03-28    1
1983-09-21    1
1986-11-09    1
1984-08-31    1
1986-06-07    1
1980-07-12    1
1984-08-05    1
1987-10-18    1
1985-04-18    1
1984-03-29    1
1990-08-22    1
1981-10-20    1
1991-02-21    1
1985-07-28    1
1980-06-24    1
1980-02-17    1
1995-10-08    1
1989-06-13    1
1985-02-14    1
1983-02-14    1
Name: birth_date, dtype: int64
------------------------------

value counts of column gender
Male      34
Female     9
Name: gender, dtype: int64
------------------------------

value counts of column married
Yes    26
No     17
Name: married, dtype: int64
------------------------------

value counts of column dependents
0     25
1      9
3+     5
2      4
Name: dependents, dtype: int64
------------------------------

value counts of column education
Graduate        29
Not Graduate    14
Name: education, dtype: int64
------------------------------

value counts of column self_employed
No     35
Yes     8
Name: self_employed, dtype: int64
------------------------------

value counts of column has_credit_card
no     23
yes    20
Name: has_credit_card, dtype: int64
------------------------------

value counts of column property_type
apartment    19
house        15
studio        9
Name: property_type, dtype: int64
------------------------------

value counts of column loan_status
APPROVE    33
REJECT     10
Name: loan_status, dtype: int64
------------------------------

Strategi Encoding

*   Label Encoding: `gender`, `dependents`,`education`, `property_type`, `loan_status`
*   One Hot Encoding: `self_employed`, `married`, `has_credit_card`

In [19]:
df = df.drop(columns='loan_id')

In [20]:
df = df.drop(columns='birth_date')

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 43 entries, 26 to 613
Data columns (total 15 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   phone_number        43 non-null     float64
 1   gender              43 non-null     object
 2   married             43 non-null     object
 3   dependents          43 non-null     object
 4   education           43 non-null     object
 5   self_employed       43 non-null     object
 6   applicant_income    43 non-null     float64
 7   coapplicant_income  43 non-null     float64
 8   loan_amount         43 non-null     int64
 9   loan_term_month     43 non-null     int64
 10  loan_term_year      43 non-null     int64
 11  credit_history      43 non-null     float64
 12  has_credit_card     43 non-null     object
 13  property_type       43 non-null     object
 14  loan_status         43 non-null     object
dtypes: float64(4), int64(3), object(8)
memory usage: 5.4+ KB

In [22]:
# Label encoding

mapping_gender = {
    'Male'      : 0,
    'Female'    : 1
}

mapping_dependents = {
    '0' : 0,
    '1' : 1,
    '2' : 2,
    '3+': 3
}

mapping_education = {
    'Graduate'      : 0,
    'Not Graduate'  : 1
}

mapping_property_type = {
    'apartment'     : 0,
    'house'         : 1,
    'studio'        : 2
}

mapping_loan_status = {
    'REJECT'        : 0,
    'APPROVE'       : 1
}

df['gender'] = df['gender'].map(mapping_gender)
df['dependents'] = df['dependents'].map(mapping_dependents)
df['education'] = df['education'].map(mapping_education)
df['property_type'] = df['property_type'].map(mapping_property_type)
df['loan_status'] = df['loan_status'].map(mapping_loan_status)

In [23]:
# One hot encoding

for cats in ['self_employed', 'married', 'has_credit_card']:
    onehot = pd.get_dummies(df[cats], prefix=cats)
    df = df.join(onehot)

In [24]:
df.head()

,phone_number,gender,married,dependents,education,self_employed,applicant_income,coapplicant_income,loan_amount,loan_term_month,...,credit_history,has_credit_card,property_type,loan_status,self_employed_No,self_employed_Yes,married_No,married_Yes,has_credit_card_no,has_credit_card_yes
26,6.281377e+11,0,Yes,0,0,No,2799.0,2253.0,122000,360,...,1.0,no,0,1,1,0,0,1,1,0
27,6.281346e+11,0,Yes,2,1,No,4226.0,1040.0,110000,360,...,1.0,yes,1,1,1,0,0,1,0,1
31,6.281348e+11,0,No,0,0,No,3167.0,0.0,74000,360,...,1.0,yes,1,0,1,0,1,0,0,1
43,6.287723e+10,0,Yes,0,0,No,3941.0,2336.0,134000,360,...,1.0,no,0,1,1,0,0,1,1,0
47,6.285642e+11,0,Yes,0,0,No,5821.0,0.0,144000,360,...,1.0,yes,1,1,1,0,0,1,0,1

In [25]:
# drop kolom berikut karena sudah diencoding
df = df.drop(columns=['self_employed', 'married','has_credit_card'])

In [26]:
# dataframe yang sudah diprocess
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 43 entries, 26 to 613
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   phone_number         43 non-null     float64
 1   gender               43 non-null     int64
 2   dependents           43 non-null     int64
 3   education            43 non-null     int64
 4   applicant_income     43 non-null     float64
 5   coapplicant_income   43 non-null     float64
 6   loan_amount          43 non-null     int64
 7   loan_term_month      43 non-null     int64
 8   loan_term_year       43 non-null     int64
 9   credit_history       43 non-null     float64
 10  property_type        43 non-null     int64
 11  loan_status          43 non-null     int64
 12  self_employed_No     43 non-null     uint8
 13  self_employed_Yes    43 non-null     uint8
 14  married_No           43 non-null     uint8
 15  married_Yes          43 non-null     uint8
 16  has_credit_card_no   43 non-null     uint8
 17  has_credit_card_yes  43 non-null     uint8
dtypes: float64(4), int64(8), uint8(6)
memory usage: 5.7 KB

# Business Insight

## Analisis minat pelanggan berdasarkan pada tipe properti

In [27]:
counting_property = df[['property_type', 'gender']].value_counts().to_frame().reset_index()
counting_property

   property_type  gender   0
0              0       0  14
1              1       0  12
2              2       0   8
3              0       1   5
4              1       1   3
5              2       1   1

# Conclussion

**Minat Pelanggan laki-laki :**

1. Apartment    : 15
2. House        : 13
3. Studio       : 8

**Minat Pelanggan perempuan :**

1. Apartment    : 5
2. House        : 3
3. Studio       : 1

## Analisis pengaruh status perkawinan terhadap jangka waktu meminjam

In [28]:
df_married_yes = df.loc[df['married_Yes'] == 1]
df_married_yes = df_married_yes[['married_Yes', 'loan_term_year']]
df_married_yes = df_married_yes['loan_term_year'].mean()
df_married_yes

27.384615384615383

In [29]:
df_married_no = df.loc[df['married_No'] == 1]
df_married_no = df_married_no[['married_No', 'loan_term_year']]
df_married_no = df_married_no['loan_term_year'].mean()
df_married_no

30.294117647058822

# Conclussion

Pelanggan yang lajang memiliki jangka waktu peminjaman rata-rata lebih panjang (30.28 tahun) dibanding pelanggan yang sudah menikah (27.48 tahun)